{
  "title": "Experience",
  "items": [
    {
      "date": "?",
      "isCurrent": true,
      "eventType": "work",
      "position": "Front End Engineer",
      "content": "Your Company",
      "contentExtras": {
        "type": "list",
        "iconList": [
          {
            "icon": "calendar check",
            "content": "Let's discuss what you're looking for and the many things we can build together."
          },
          {
            "icon": "coffee",
            "content": "(Ready to justify my coffee addiction)"
          }
        ]
      },
      "additionalTimeframeEvents": [
        {
          "date": "Soon..."
        }
      ]
    },
    {
      "date": "2023 - January",

      "content": "Trantor Engineering",
      "position": "Full Stack Engineer / Front End Developer",
      "contentExtras": {
        "type": "list",
        "iconList": [
          {
            "icon": "book",
            "content": "Developed and implemented a full stack, social book recommendation platform in collaboration with local and national book club organizations."
          },
          {
            "icon": "react",
            "content": "Utilized React (React Router + Redux) and Typescript to build the front-end, incorporating MUI and other UI frameworks for enhanced user experience."
          },
          {
            "icon": "database",
            "content": "Designed and architected features such as advanced search functionality utilizing Google Books, Open Library, and other API services. Leveraged PostgreSQL database for efficient data management, implementing authentication, session management, and custom SQL functions."
          }
        ]
      },
      "additionalTimeframeEvents": [
        {
          "date": "Q2 - Q3 2023",
          "type": "list",
          "contentExtras": {
            "date": "May 2023",
            "type": "list",
            "iconList": [
              {
                "icon": "file code",
                "content": "Strategized and built custom Javascript module for a toy-making client utilizing the Scratch Blocks API. Utilized custom prototypes to pitch various front end solutions and opportunities to investors."
              },
              {
                "icon": "microchip",
                "content": "Built communication infrastructure between arduino-based micro-controllers for use with small robotic peripherals in toys."
              }
            ]
          }
        },
        {
          "date": "2023 - January"
        }
      ]
    },
    {
      "date": "2022 - Sept",
      "eventType": "work",
      "content": "Snap Inc",
      "position": "Front End Developer / Contributing Engineer",
      "contentExtras": {
        "type": "list",
        "iconList": [
          {
            "icon": "shop",
            "content": "Strategized, roadmapped and developed the initial groundwork for a unified SDK to standardize the web-based entry point for eCommerce developers to enable Snap’s web-based Augmented Reality, Virtual Try-On, and 3D experiences for client e-commerce products."
          },
          {
            "icon": "react",
            "content": "Refactored experiences into reusable React components (written in Typescript) which integrated into an existing clients tech stack."
          },
          {
            "icon": "copyright",
            "content": "Worked with client UX design teams to ensure that all experiences communicate a clients brand, design standards, and business objectives."
          },
          {
            "icon": "conversation",
            "content": "Leveraged various A/B testing scaffolding frameworks to ensure clients received insight into customer behaviors, conversion activity, and areas for UI improvement."
          }
        ]
      },
      "additionalTimeframeEvents": [
        {
          "date": "2021 - August",
          "type": "event",
          "content": "Vertebrae is acquired by Snap Inc"
        },
        {
          "date": "2020 - January",
          "content": "Hired at Vertebrae, Austin based AR/Virtual Try-On startup"
        }
      ]
    },
    {
      "date": "2019 - December",

      "content": "Charles Schwab",
      "position": "Design Technologist",
      "contentExtras": {
        "type": "list",
        "iconList": [
          {
            "icon": "sitemap",
            "content": "Designed, implemented, and scaled a reusable & accessible Design System which leveraged design standards from the global Schwab UX team while establishing a community-driven standard of code re-usability, readability, and quality."
          },
          {
            "icon": "file code",
            "content": "Strategized future-state enterprise level JS framework solutions like a framework agnostic front end approach using Web Components."
          },
          {
            "icon": "map",
            "content": "Co-designed and rapidly developed prototypes with the global user experience team to transition hero Schwab.com components like navigation and footer from an adaptive experience to a unified responsive solution."
          }
        ]
      },
      "additionalTimeframeEvents": [
        {
          "date": "2017 - May"
        }
      ]
    }
  ]
}
